package Library;

public class Spisok extends Izdanie {

	public Spisok() {
		Kniga[] list = new Kniga[10];
		list[0] = new Kniga("категория: Наука", "Автор: Математик", "Математика для всех");
		list[1] = new Kniga("категория: Военное дело", "Автор: Полковник", "Стрелковое оружие");
		list[2] = new Kniga("категория: Детская литература", "Автор: Сказочник", "Сказки");
		list[3] = new Kniga("категория: Романы", "Автор: Романтик", "Сопли");
		list[4] = new Kniga("категория: Наука", "Автор: Физик", "Физика для всех");
		list[5] = new Kniga("категория: Военное дело", "Автор: Генерал", "Авиация");
		list[6] = new Kniga("категория: Детская литература", "Автор: Поэт", "Стихи для самых маленьких");
		list[7] = new Kniga("категория: Романы", "Автор: Соплежуй", "Мыльная опера");
		list[8] = new Kniga("категория: Наука", "Автор: Химик", "Химия для всех");
		list[9] = new Kniga("категория: Наука", "Автор: Математик", "Геометрия для всех");

		for (int i = 0; i < 10; i++) {
			System.out.println(list[i].getName());
		}

	}
}
